app/views/home/_navbar.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <% elsif current_page?(new_category_expense_path) %>
        <% @category = Category.find(params[:category_id]) %>