app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "icon", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "school"], ["icon", "images"], ["created_at", "2023-10-20 15:47:34.964503"], ["updated_at", "2023-10-20 15:47:34.964503"]]