app/controllers/expenses_controller.rb

  def index
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @expense = Expense.new
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @expense = Expense.new(expense_params)

    @category = Category.find(params[:category_id])
    @expense.categories << @category

    @expense.author_id = current_user.id

    respond_to do |format|
      if @expense.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "expenses" ("name", "amount", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "book"], ["amount", 20], ["created_at", "2023-10-20 15:47:56.181265"], ["updated_at", "2023-10-20 15:47:56.181265"], ["author_id", 1]]
INSERT INTO "category_expenses" ("category_id", "expense_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 1], ["expense_id", 1], ["created_at", "2023-10-20 15:47:56.186738"], ["updated_at", "2023-10-20 15:47:56.186738"]]

    def set_expense
      @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]