app/controllers/expenses_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @expenses = @category.expenses.where(author: current_user).order(created_at: :desc)
---
SELECT "expenses".* FROM "expenses" INNER JOIN "category_expenses" ON "expenses"."id" = "category_expenses"."expense_id" WHERE "category_expenses"."category_id" = $1 AND "expenses"."author_id" = $2 ORDER BY "expenses"."created_at" DESC  [["category_id", 1], ["author_id", 1]]

  def set_expense
    @expense = Expense.find(params[:id])
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]