app/models/category.rb

SELECT SUM("expenses"."amount") FROM "expenses" INNER JOIN "category_expenses" ON "expenses"."id" = "category_expenses"."expense_id" LEFT OUTER JOIN "category_expenses" "category_expenses_expenses" ON "category_expenses_expenses"."expense_id" = "expenses"."id" WHERE "category_expenses"."category_id" = $1 AND "expenses"."author_id" = $2  [["category_id", 1], ["author_id", 1]]
---
  def total_amount(user)
    expenses.where(author_id: user.id).eager_load(:category_expenses).sum('expenses.amount')